#### `terraform plan` Success
<details><summary>Show Output</summary>

```
   + member  = (known after apply)
      + project = "terra-datarepo-production"
      + role    = "roles/resourcemanager.projectIamAdmin"
    }

  # module.datarepo-app.google_project_iam_member.sql_sa_role[0] will be created
  + resource "google_project_iam_member" "sql_sa_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "terra-datarepo-production"
      + role    = "roles/cloudsql.client"
    }

  # module.datarepo-app.google_service_account.datarepo_api_sa[0] will be created
  + resource "google_service_account" "datarepo_api_sa" {
      + account_id   = "datarepo-jade-api"
      + display_name = "datarepo-jade-api"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "terra-datarepo-production"
      + unique_id    = (known after apply)
    }

  # module.datarepo-app.google_service_account.datarepo_sql_sa[0] will be created
  + resource "google_service_account" "datarepo_sql_sa" {
      + account_id   = "datarepo-jade-sql"
      + display_name = "datarepo-jade-sql"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "terra-datarepo-production"
      + unique_id    = (known after apply)
    }

  # module.datarepo-app.google_service_account_key.api_sa_key[0] will be created
  + resource "google_service_account_key" "api_sa_key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # module.datarepo-app.google_service_account_key.sql_sa_key[0] will be created
  + resource "google_service_account_key" "sql_sa_key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # module.datarepo-app.vault_generic_secret.api_sa_key[0] will be created
  + resource "vault_generic_secret" "api_sa_key" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/production/datarepo-api-sa"
    }

  # module.datarepo-app.vault_generic_secret.sql_db_password[0] will be created
  + resource "vault_generic_secret" "sql_db_password" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/production/datarepo-sql-db"
    }

  # module.datarepo-app.vault_generic_secret.sql_sa_key[0] will be created
  + resource "vault_generic_secret" "sql_sa_key" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/production/datarepo-sql-sa"
    }

  # module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy will be created
  + resource "google_compute_security_policy" "policy" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "broad-cloud-armor"
      + project     = (known after apply)
      + self_link   = (known after apply)

      + rule {
          + action   = "allow"
          + priority = 0

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "69.173.112.0/21",
                      + "69.173.127.0/25",
                      + "69.173.127.128/26",
                      + "69.173.127.232/29",
                      + "69.173.127.240/28",
                    ]
                }
            }
        }
      + rule {
          + action   = "allow"
          + priority = 1

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "69.173.120.0/22",
                      + "69.173.126.0/24",
                      + "69.173.127.224/30",
                      + "69.173.127.228/32",
                      + "69.173.127.230/31",
                    ]
                }
            }
        }
      + rule {
          + action   = "allow"
          + priority = 2

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "69.173.124.0/23",
                      + "69.173.127.192/27",
                      + "69.173.64.0/19",
                      + "69.173.96.0/20",
                    ]
                }
            }
        }
      + rule {
          + action      = "deny(403)"
          + description = "Default rule: deny all"
          + priority    = 2147483647

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "*",
                    ]
                }
            }
        }
    }

  # module.core-infrastructure.module.k8s-master.google_container_cluster.cluster will be created
  + resource "google_container_cluster" "cluster" {
      + additional_zones            = (known after apply)
      + cluster_ipv4_cidr           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = false
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = false
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + min_master_version          = "1.16.13-gke.1"
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "jade-master-us-central1"
      + network                     = "production-network"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + region                      = (known after apply)
      + remove_default_node_pool    = true
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "production-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)
      + zone                        = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled = (known after apply)
            }

          + config_connector_config {
              + enabled = (known after apply)
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + istio_config {
              + disabled = true
            }

          + kalm_config {
              + enabled = (known after apply)
            }

          + kubernetes_dashboard {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + autoscaling_profile = (known after apply)
          + enabled             = (known after apply)

          + auto_provisioning_defaults {
              + min_cpu_platform = (known after apply)
              + oauth_scopes     = (known after apply)
              + service_account  = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + cluster_telemetry {
          + type = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "pods"
          + node_ipv4_cidr_block          = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "services"
          + subnetwork_name               = (known after apply)
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = true
            }
        }

      + master_authorized_networks_config {
          + cidr_blocks {
              + cidr_block = "34.68.105.207/32"
            }
          + cidr_blocks {
              + cidr_block = "35.184.212.129/32"
            }
          + cidr_blocks {
              + cidr_block = "69.173.112.0/21"
            }
          + cidr_blocks {
              + cidr_block = "69.173.120.0/22"
            }
          + cidr_blocks {
              + cidr_block = "69.173.124.0/23"
            }
          + cidr_blocks {
              + cidr_block = "69.173.126.0/24"
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.0/25"
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.128/26"
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.192/27"
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.224/30"
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.228/32"
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.230/31"
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.232/29"
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.240/28"
            }
          + cidr_blocks {
              + cidr_block = "69.173.64.0/19"
            }
          + cidr_blocks {
              + cidr_block = "69.173.96.0/20"
            }
        }

      + network_policy {
          + enabled = true
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = (known after apply)
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = (known after apply)
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + boot_disk_kms_key = (known after apply)
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + pod_security_policy_config {
          + enabled = true
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "10.227.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config {
              + enabled = (known after apply)
            }
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + workload_identity_config {
          + identity_namespace = "terra-datarepo-production.svc.id.goog"
        }
    }

  # module.core-infrastructure.module.k8s-nodes.google_container_node_pool.pool will be created
  + resource "google_container_node_pool" "pool" {
      + cluster             = "jade-master-us-central1"
      + id                  = (known after apply)
      + initial_node_count  = (known after apply)
      + instance_group_urls = (known after apply)
      + location            = "us-central1"
      + max_pods_per_node   = (known after apply)
      + name                = "jade-node-us-central1"
      + name_prefix         = (known after apply)
      + node_count          = 2
      + node_locations      = (known after apply)
      + project             = (known after apply)
      + region              = (known after apply)
      + version             = (known after apply)
      + zone                = (known after apply)

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 50
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = "COS"
          + labels            = {
              + "environment" = "jade"
              + "project"     = "terra-datarepo-production"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n1-standard-2"
          + metadata          = {
              + "disable-legacy-endpoints"         = "true"
              + "google-compute-enable-virtio-rng" = "false"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + tags              = [
              + "terra-datarepo-production",
              + "jade",
              + "kubernetes",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0] will be created
  + resource "google_compute_global_address" "private_ip_address" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "datarepo-db-jade-private-address"
      + network            = (known after apply)
      + prefix_length      = 16
      + project            = (known after apply)
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
    }

  # module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0] will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "datarepo-db-jade-private-address",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"] will be created
  + resource "google_sql_database" "app_database" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "datarepo"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"] will be created
  + resource "google_sql_database" "app_database" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "stairway"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0] will be created
  + resource "google_sql_database_instance" "cloudsql_instance" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_11"
      + encryption_key_name           = (known after apply)
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + project                       = "terra-datarepo-production"
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy      = "ALWAYS"
          + availability_type      = "REGIONAL"
          + crash_safe_replication = (known after apply)
          + disk_autoresize        = true
          + disk_size              = (known after apply)
          + disk_type              = "PD_SSD"
          + pricing_plan           = "PER_USE"
          + replication_type       = "SYNCHRONOUS"
          + tier                   = "db-g1-small"
          + user_labels            = {
              + "app" = "datarepo"
              + "env" = "jade"
            }
          + version                = (known after apply)

          + backup_configuration {
              + binary_log_enabled = false
              + enabled            = true
              + start_time         = "06:00"
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = (known after apply)
              + require_ssl     = true
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"] will be created
  + resource "google_sql_user" "app_user" {
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "drmanager"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"] will be created
  + resource "google_sql_user" "app_user" {
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "drmanager"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # module.datarepo-app.module.cloudsql.google_sql_user.root_user[0] will be created
  + resource "google_sql_user" "root_user" {
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "root"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"] will be created
  + resource "random_id" "app_user_password" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"] will be created
  + resource "random_id" "app_user_password" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0] will be created
  + resource "random_id" "cloudsql_id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.datarepo-app.module.cloudsql.random_id.root_user_password[0] will be created
  + resource "random_id" "root_user_password" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.datarepo-app.module.workloadid.google_project_iam_member.user-sql-sa-role["production"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "terra-datarepo-production"
      + role    = "roles/cloudsql.client"
    }

  # module.datarepo-app.module.workloadid.google_service_account.user-sql-service-account["production"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "production-workload-proxy-sa"
      + display_name = "production-workload-proxy-sa"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.datarepo-app.module.workloadid.google_service_account_iam_binding.sqlproxy_workload_identity_binding["production"] will be created
  + resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:terra-datarepo-production.svc.id.goog[production/production-jade-gcloud-sqlproxy]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.datarepo-app.module.workloadid.google_service_account_key.user-sql-sa-key["production"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_bigquery_dataset.logs[0] will be created
  + resource "google_bigquery_dataset" "logs" {
      + creation_time               = (known after apply)
      + dataset_id                  = (known after apply)
      + default_table_expiration_ms = 7776000000
      + delete_contents_on_destroy  = false
      + description                 = "Audit logs for datarepo for production"
      + etag                        = (known after apply)
      + id                          = (known after apply)
      + labels                      = {
          + "env" = "production"
        }
      + last_modified_time          = (known after apply)
      + location                    = "US"
      + project                     = (known after apply)
      + self_link                   = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_bigquery_dataset_access.access will be created
  + resource "google_bigquery_dataset_access" "access" {
      + dataset_id    = (known after apply)
      + id            = (known after apply)
      + project       = (known after apply)
      + role          = "OWNER"
      + special_group = "allAuthenticatedUsers"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_logging_project_sink.bigquery-log-sink[0] will be created
  + resource "google_logging_project_sink" "bigquery-log-sink" {
      + destination            = (known after apply)
      + filter                 = "resource.type=\"audited_resource\""
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_logging_project_sink.bucket-log-sink[0] will be created
  + resource "google_logging_project_sink" "bucket-log-sink" {
      + destination            = (known after apply)
      + filter                 = "resource.type=\"audited_resource\""
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-admin[0] will be created
  + resource "google_project_iam_binding" "bigquery-admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.admin"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-data[0] will be created
  + resource "google_project_iam_binding" "bigquery-data" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.dataOwner"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0] will be created
  + resource "google_project_iam_binding" "bigquery-log-writer-permisson" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.configWriter"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.pubsub-publisher-permisson[0] will be created
  + resource "google_project_iam_binding" "pubsub-publisher-permisson" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_storage_bucket.logs[0] will be created
  + resource "google_storage_bucket" "logs" {
      + bucket_policy_only = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + location           = "US"
      + name               = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + storage_class      = "STANDARD"
      + url                = (known after apply)
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_storage_bucket_iam_member.bucket-log-writer[0] will be created
  + resource "google_storage_bucket_iam_member" "bucket-log-writer" {
      + bucket = (known after apply)
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectCreator"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.random_id.id will be created
  + resource "random_id" "id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.datarepo-monitoring.module.performance-log-sinks.google_bigquery_dataset.logs[0] will be created
  + resource "google_bigquery_dataset" "logs" {
      + creation_time               = (known after apply)
      + dataset_id                  = (known after apply)
      + default_table_expiration_ms = 2678400000
      + delete_contents_on_destroy  = false
      + description                 = "Audit logs for datarepo for production"
      + etag                        = (known after apply)
      + id                          = (known after apply)
      + labels                      = {
          + "env" = "production"
        }
      + last_modified_time          = (known after apply)
      + location                    = "US"
      + project                     = (known after apply)
      + self_link                   = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.datarepo-monitoring.module.performance-log-sinks.google_bigquery_dataset_access.access will be created
  + resource "google_bigquery_dataset_access" "access" {
      + dataset_id    = (known after apply)
      + id            = (known after apply)
      + project       = (known after apply)
      + role          = "OWNER"
      + special_group = "allAuthenticatedUsers"
    }

  # module.datarepo-monitoring.module.performance-log-sinks.google_logging_project_sink.bigquery-log-sink[0] will be created
  + resource "google_logging_project_sink" "bigquery-log-sink" {
      + destination            = (known after apply)
      + filter                 = "resource.type=\"k8s_container\" \"PerformanceLogger\""
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.bigquery-admin[0] will be created
  + resource "google_project_iam_binding" "bigquery-admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.admin"
    }

  # module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.bigquery-data[0] will be created
  + resource "google_project_iam_binding" "bigquery-data" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.dataOwner"
    }

  # module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0] will be created
  + resource "google_project_iam_binding" "bigquery-log-writer-permisson" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.configWriter"
    }

  # module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.pubsub-publisher-permisson[0] will be created
  + resource "google_project_iam_binding" "pubsub-publisher-permisson" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
    }

  # module.datarepo-monitoring.module.performance-log-sinks.random_id.id will be created
  + resource "random_id" "id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_bigquery_dataset.logs[0] will be created
  + resource "google_bigquery_dataset" "logs" {
      + creation_time               = (known after apply)
      + dataset_id                  = (known after apply)
      + default_table_expiration_ms = 2678400000
      + delete_contents_on_destroy  = false
      + description                 = "Audit logs for datarepo for production"
      + etag                        = (known after apply)
      + id                          = (known after apply)
      + labels                      = {
          + "env" = "production"
        }
      + last_modified_time          = (known after apply)
      + location                    = "US"
      + project                     = (known after apply)
      + self_link                   = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_bigquery_dataset_access.access will be created
  + resource "google_bigquery_dataset_access" "access" {
      + dataset_id    = (known after apply)
      + id            = (known after apply)
      + project       = (known after apply)
      + role          = "OWNER"
      + special_group = "allAuthenticatedUsers"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_logging_project_sink.bigquery-log-sink[0] will be created
  + resource "google_logging_project_sink" "bigquery-log-sink" {
      + destination            = (known after apply)
      + filter                 = "resource.type=\"k8s_container\" \"LoggerInterceptor\""
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-admin[0] will be created
  + resource "google_project_iam_binding" "bigquery-admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.admin"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-data[0] will be created
  + resource "google_project_iam_binding" "bigquery-data" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.dataOwner"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0] will be created
  + resource "google_project_iam_binding" "bigquery-log-writer-permisson" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.configWriter"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.pubsub-publisher-permisson[0] will be created
  + resource "google_project_iam_binding" "pubsub-publisher-permisson" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.random_id.id will be created
  + resource "random_id" "id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 74 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `environments/production`*
